//此类题目，把菱形分为上下两部分，上半部分包括最长行及其以上部分，有n行，下半部分有n-1行，总共2n-1行
//分析上半部分：分为空格部分和字符部分
//空格数=n-i，[0,n-i)刚好循环n-i次
//字符数=2i-1，[0-2i-1)刚好循环2i-1次
//每行输入完成后要换行
//分析下半部分：分为空格部分和字符部分
//空格数=i，[0,i)刚好循环i次
//字符数=n-1（等差数列）
#include <stdio.h>
int main() {
	char ch;
	scanf("%c", &ch);
	int n = 5;  //设包括对角线在内的上半部分有n行
	int i, j;	//循环变量

	for (i = 1; i <= n; i++) { 		//打印第1行到对角线(第n行)
		for (j = 0; j < n - i; j++)
			printf(" "); 			//先打印每行的空格，第i行有n-i个空格
		for (j = 0; j < 2 * i - 1; j++)
			printf("%c", ch);   	//再打印每行的字符，第i行有2*i-1个
		printf("\n");    			//打印完每行空格和字符，要换行
	}

	for (i = n-1; i >= 1; i--) { //对角线以下部分只有n-1行，从1到n-1
		for (j = 0; j < n - i; j++)
			printf(" ");  //每行前面的空格依次增加1个，第i行有i个空格
		for (j = 0; j < (2 * i - 1); j++)
			printf("%c", ch);  //每行的字符依次减少2个，第i行有2*(n-i)-1个
		printf("\n");
	}
	return 0;
}
